use dinner;

create table food_type(
    id              INT unsigned auto_increment PRIMARY KEY,
    food_type       VARCHAR(10)
);

create table food(
	id              INT unsigned auto_increment PRIMARY KEY,
	food_type_id    INT comment '음식 카테고리 성격의 칼럼',
	name            VARCHAR(20) unique,
	ingredient      LONGTEXT,
	spice           LONGTEXT,
	recipe          LONGTEXT,
    calorie         INT(5) comment '단위는 cal',
	carbohydrate    INT(5) comment '단위는 g',
	protein         INT(5) comment '단위는 g',
	vitamin         INT(5) comment '단위는 g'
);

insert into food_type(food_type)
values
('반찬'),
('국');
INSERT INTO food(food_type_id, name, ingredient, spice, recipe, calorie, carbohydrate, protein, vitamin)
VALUES
('2','오뎅국','오뎅', '멸치액젓', '오뎅을 넣고 끓인다', '174', '44', '44', '44'),
('1','오이소박이','오이', '고추가루', '무야호무야호무야호', '319.6', '33', '33', '33'),
('2','미역국','미역', '들기름', '무야호무야호무야호', '290', '1', '1', '1'),
('2','계란국','계란', '육수', '무야호무야호', '120', '2', '2', '2'),
('1','고등어갈비구이','고등어', '고추장', '무야호', '570', '11', '11', '11'),
('1','간장목살구이','목살', '간장', '무야호무양호', '792', '22', '22', '22'),
('1','갈배제육','앞다리살', '고추장', '무야호무양호', '572', '22', '22', '22'),
('1','상추 겉절이','상추', '고추가루', '무야호무양호', '32.8', '22', '22', '22'),
('1','두부조림','두부', '고추가루', '무야호무양호', '389', '22', '22', '22'),
('1','무고등어조림','고등어, 무', '고추장', '무야호무양호', '395', '22', '22', '22'),
('1','갈치조림','갈치', '고추가루', '무야호무양호', '405', '22', '22', '22'),
('1','소세지 야채 볶음','소세지', '케찹', '무야호무양호', '166.3', '22', '22', '22'),
('1','간장어묵볶음','어묵', '간장', '무야호무양호', '137', '22', '22', '22'),
('1','버섯잡채','당면', '간장', '무야호무양호', '233.3', '22', '22', '22'),
('1','계란찜','계란', '소금', '무야호무양호', '383', '22', '22', '22'),
('2','돼지김치짜글이','앞다리살', '육수', '무야호무야호', '290', '2', '2', '2'),
('2','들깨배춧국','배추', '들깨', '무야호무야호', '260.8', '2', '2', '2'),
('2','소고기뭇국','무, 소고기', '육수', '무야호무야호', '192', '2', '2', '2'),
('2','콩나물국','콩나물', '고추가루, 멸치액젓, 소금', '무야호무야호', '240', '2', '2', '2');
